<template>
	<view class="agreement-page">

		<view class="agreement-text" :class="getClass">
			<scroll-view :scroll-y="true" class="scroll-y">
				<view class="item-contian">
					<view class="title">觅活平台店铺协议</view>
					<text>
						签约须知：
						  《觅活平台店铺协议》（以下简称“本协议”）是由觅活平台（包括但不限于觅活网站www.51mihuo.com、APP、微信公众号及小程序等）的运营方即深圳觅活科技有限公司（以下简称“甲方”）与以独立第三方经营者身份入驻觅活平台的法律实体（以下简称“乙方”或“商家”）达成的关于提供和使用觅活平台服务的各项条款。
						   
						  甲方在此特别提醒乙方认真阅读本协议各条款（对于本协议中以加粗字体显示的内容，应重点阅读），并请乙方审慎考虑并选择接受或不接受本协议。如果乙方点击“我已经阅读并同意”按钮（前述按钮的具体表述可能会做适当调整，下同），即表示乙方已充分阅读、理解并自愿接受本协议，同意受本协议各项条款的约束。
						      本“签约须知”为本协议正文的组成部分。

						1. 协议内容及生效
						1.1. 协议内容。本协议包括协议正文、附件及所有甲方已经发布的或将来可能发布的各类规则、规范、规则解读、实施细则、通知、公告等（以下合称“平台规则”）。所有附件及平台规则均为本协议不可分割的一部分，与协议正文具有同等法律效力。协议正文、附件与平台规则冲突的，以发布在后的文件为准执行。
						1.2. 协议变更及生效。甲方有权变更（包括但不限于制定、修订、废止）本协议正文、附件及/或平台规则，将至少提前7日在甲方网站公示，并载明生效日期，乙方应实时关注公示内容。如乙方不接受变更，应当在公示期间内申请退店，则乙方店铺将进入“关店准备”状态，店铺内商品将全部下架，无法上架新商品，本协议将终止。乙方清楚知晓、同意并确认前述“关店准备”状态下的店铺功能限制，甲方对于该等限制、协议终止不负有任何违约责任或其他责任。如乙方未按前述约定申请退店，即视为乙方接受前述变更事项。
						1.3.
						服务开通。商家申请入驻觅活平台时，商家签署或在线接受本协议后本协议立即生效，但本协议项下的平台服务并不立即开通。商家履行上传相关资质、支付保证金等义务，经甲方审核通过并向商家发出服务开通通知（通知方式包括但不限于站内信、手机短信等）时，本协议项下的平台服务正式开通。
						1.4. 觅活旗下产品及服务：是指甲方及/或其关联公司开发、运营的所有现有及未来可能出现的产品或服务，包括但不限于觅活平台。
						1.5.
						关联公司：是指一方直接或间接控制、共同控制另一方，以及两方或两方以上受同一主体控制、共同控制的公司。前述“控制”是指，直接或间接拥有的权力，从而通过行使表决权、合同或其他方式决定或影响某一方的管理或决策方向。
						2. 合作方式
						2.1.
						账户密码。商家完成入驻后，会获得相应店铺商家后台的账户及密码，商家在遵守本协议及平台规则、不存在违约情形的前提下，可以通过商家后台进行店铺日常经营。若商家存在违约行为，平台有权限制商家后台的部分或全部功能。
						2.2.
						守法依规经营。商家在觅活平台开店成功后，应当根据法律、法规及平台规则发布商品（包括服务，下同）、提供售前售后服务、提供商品免费包邮服务、提供订单支持适用的服务及其他各项服务，双方另有约定或甲方平台规则另有规定的除外；同时商家应依法为消费者开具正规的商品发票，相关税费由商家自行承担。
						2.3. 甲方服务范围。甲方负责觅活平台的日常维护、技术支持，保证平台的正常运作。作为电子商务平台经营者，甲方仅为商家与消费者达成交易提供网页空间、虚拟经营场所、交易规则等服务，甲方并非商家与消费者之间交易行为的参与方，不对商家及/或消费者的任何口头、书面陈述或承诺，发布的信息及交易行为的真实性、合法性、准确性、及时性、有效性等作任何明示或暗示的保证。
						2.4. 调整商品展示位置。除双方另有约定外，甲方有权根据商品销量、商品价格、商品质量、商家的服务水平等综合因素调整商品的展示位置。
						2.5. 收费标准。商家充分理解并确认，甲方有权就平台向商家提供的各项服务收取费用，具体收费标准以双方之间的约定（如有）或平台规则的规定为准。
						2.6. 技术服务费。商家无条件并不可撤销地授权甲方通知相关合作方（包括但不限于第三方支付机构、合作银行等）自店铺资金中直接扣除相应的技术服务费,结算数据以觅活平台系统记录为准。订单发生退款的，退款时不另行收取技术服务费，但已收取的技术服务费不做退还。甲方有权单方面调整技术服务费费率及/或结算方式并在平台上公布。
						3. 资格要求、证明文件及信息
						3.1. 资格要求。商家保证具有履行本协议所需的行为能力及所有必要的资质和授权。
						3.2. 证明文件及信息提交。商家应当向甲方或甲方指定合作方提交其应当提供的证明文件及联系人、联系地址、联系电话、联系邮箱等信息。
						3.3. 证明文件及信息变更的通知。协议期内，上述相关证明文件或信息发生任何变更，商家都应及时通知甲方并更新相关证明文件或信息。
						3.4. 店铺类型的确定。甲方有权对商家店铺类型做出判断及/或变更，并有权根据店铺类型确定对商家具体适用的平台规则，商家同意遵守前述对其适用的平台规则。
						3.5. 抽查。甲方有权对商家提供的证明文件及信息进行不定时的抽查，并有权要求商家提供证明文件原件供核对或补充提供证明文件、信息，商家应当提供。如商家不能提供，则甲方有权立即中止/解除本协议。
						3.6. 查询核验。商家无条件并不可撤销地授权甲方及相关合作方（包括但不限于第三方支付机构、合作银行等）查询并核验商家信息，包括但不限于征信信息、身份信息、联系信息等，并同意甲方与相关合作方共享上述信息。
						3.7.
						商家责任。商家保证其向甲方及相关合作方提供的全部文件及信息全面、真实、准确、合法、有效。商家提供虚假、过期、失效文件或信息，或未及时通知并更新其文件或信息的，应独立承担全部法律责任。商家违反本条约定义务的，甲方有权立即中止/解除本协议，并要求商家支付违约金，该违约金不足以弥补商家违约行为给甲方（包括其合作伙伴、代理人、职员等）或其他任何第三方造成的全部损失的，甲方有权要求商家补足。
						4. 商品交付
						4.1. 合同与发货。买家支付价款，则商家与买家之间的买卖合同成立；订单确认时，商家与买家之间的买卖合同生效。
						商家应按对消费者的承诺及平台规则（包括但不限于《觅活发货规则》、《觅活特殊商品发货规则》等）及时将商品交付消费者。
						4.2.
						商品包装。商家应按对消费者的承诺及平台规则对商品进行包装，包装费用由商家承担。商家在包装中不得夹带任何违反法律法规或本协议约定的资料、宣传单等，不得附带任何非正常交易或服务所必需的第三方网站或店铺信息等。
						4.3. 违规行为的判定和处理。甲方有权对商家延迟发货、虚假发货、缺货、欺诈发货等违规行为进行处理，相关定义及违规判定、处理方式以平台规则的规定为准。
						5. 商品质量保证
						5.1.
						总体要求。商家保证所售商品符合《中华人民共和国产品质量法》等法律法规、规章、相关标准、本协议约定及平台规则之规定（包括但不限于商品安全性，商品功能材质、标识标志、外观、包装与描述符合性等）。
						5.2. 如实描述。商家保证如实描述有关商品信息，不做引人误解的虚假宣传，不存在发布虚假广告、欺骗和误导消费者等行为。
						5.3. 正品保证。商家保证商品来源真实、合法，未侵犯他人商标专用权、专利权、著作权或其他合法权益，不存在伪造商品产地，伪造或冒用他人厂名、厂址、认证标志、质量标志、名优标志、包装装潢等行为。
						5.4.
						品质保证。商家保证销售的所有商品清洁、整齐、包装完好、适宜销售。商品属于国家强制性产品认证类目的，应当符合认证要求。凡有保质期的商品，在送达消费者订单指定收货地时均在保质期内。对于临近保质期的商品，商家应在商品页面的显著位置作出说明。
						5.5.
						标签瑕疵。商家保证销售的所有商品及吊牌、商品外包装上，不存在任何之前在其他商场或任何渠道销售的标志、价格。如商家对商品之前的价格标签未作处理或出现价格标签重叠、错粘或其他足以影响甲方商业信誉的标志或瑕疵，商家应当为甲方消除影响并承担赔偿责任。
						5.6. 不合格商品的退回。商家销售的商品不符合国家相关法律法规、规章、相关标准、本协议约定及平台规则规定的，视为不合格商品。商家销售不合格商品，消费者有权将该商品退回商家，运费由商家承担。
						5.7. 严重问题商品的认定及处理
						5.7.1. 严重问题商品的认定。若经消费者投诉、品牌方投诉、甲方调查、司法机关或者行政机关调查等途径，发现商家存在下列情形之一的，则涉及商品将被认定为“严重问题商品”：
						（1）销售假冒伪劣商品或者过期商品；
						（2）提供非法服务；
						（3）违反本协议第5条规定的商品质量要求且情节较为严重；
						（4）与上述行为性质类似、甲方认为不宜继续销售的其他情形。
						5.7.2. 严重问题商品的处理。商家销售“严重问题商品”的，甲方可对全店商品作即时下架处理，并通知商家提供相关证据，包括但不限于商品销售许可、进货凭证、授权销售证明、商品进口证明等，商家应立即提交。若商家不能及时提供有效证明文件，甲方有权采取下列一项或多项措施：
						（1）立即解除本协议；
						（2）限制商家店铺资金（包括但不限于店铺保证金、活动保证金及货款，下同）提现；
						（3）要求商家支付通过觅活平台销售的“严重问题商品”历史总销售额（以商品ID为准）的数倍作为消费者赔付金赔付消费者，且甲方有权以商家店铺资金抵扣消费者赔付金赔付消费者；
						（4）扣除商家交纳的保证金；
						（5）平台规则规定的其他违规处理措施。
						5.8. 召回。若因商家销售的商品存在缺陷危及人身财产安全，或存在重大安全问题，或因法律诉讼等情形，甲方有权决定召回有关产品，商家应按甲方要求完成对召回产品的退、换、维修，在甲方平台或甲方指定的其他网站公布召回信息，并承担由此产生的所有费用。
						5.9. 违规认定。甲方有权根据平台规则（包括但不限于《觅活假货处理规则》、《觅活商品描述及质量抽检规则》等），对商家销售假货、商品描述及质量抽检不合格等行为进行处理，“假货”、“商品描述”、“抽检不合格”等相关定义及违规判定、处理方式以平台规则的规定为准。
						5.10. 违约责任。商家违反本协议第5条约定的，还应当承担相关违约责任，赔偿甲方、消费者或第三方由此产生的所有损失。
						6. 售后及客户服务
						6.1.
						售后责任。商家应根据相关法律法规、本协议约定以及平台规则之规定，负责为消费者提供商品的“修理、更换、退货”等售后服务，并承担因上述售后服务而产生的一切费用（包括但不限于往返运费、退换货费用等），保障消费者的合法权益，避免甲方承担因商品售后服务而产生的任何法律责任（包括但不限于任何赔偿、补偿或处罚）或声誉受损。
						6.2. 客户服务
						6.2.1.
						回复要求。商家应指派专人负责处理客户服务问题，并将服务电话及工作邮件向甲方备案。商家的回复内容中应包含对于该问题的解释、明确的处理方案及事件说明，“正在查询/正在沟通”等无实质解决方案的回复视为延迟回复，具体以甲方的认定为准。
						6.2.2. 问题范围。客户服务问题包括但不限于：商品咨询、退换货政策、取消订单、物流快递问题等。
						6.3.
						监督检查。甲方有权对商家售后服务及客户服务的质量进行监督检查，根据平台规则（包括但不限于《觅活售后规则》、《觅活商家客户服务管理规则》）对商家进行考核，并对售后服务不达标、客服回复率或者回复态度不符合要求的商家进行处理。
						7. 保证金及货款结算
						7.1. 保证金的缴存。商家应当根据平台规则（包括但不限于《觅活保证金规则》）之规定，向甲方缴存保证金；对于该等保证金（包括补缴的保证金），甲方无须支付任何利息等孳息。
						7.2. 保证金标准的调整。甲方有权根据平台规则的调整、店铺经营状况的变化、商家违约情形及/或实际赔付情况、潜在赔付风险等情况，调整商家保证金标准。
						7.3. 保证金的补足。因保证金标准调整或其他原因导致商家保证金余额低于其应缴存保证金标准的，甲方有权要求商家在指定期限内补足，或自店铺资金中划转相应的金额予以补足。商家未在指定期限内补足，或者店铺资金不足以补足保证金的，甲方有权解除本协议，停止服务。
						7.4. 保证金的退还。店铺关闭后，平台将按照平台规则之规定，退还商家保证金。
						7.5.
						货款入账。正常经营情况下，商家发货满15日或消费者确认收货后（以较早者为准），消费者支付的货款、自消费者账户下扣划的货款自动进入商家账户，商家可提取货款。若商家存在虚假发货、欺诈发货等违约行为，甲方有权调整相关订单的自动确认收货时间，或者取消商家店铺订单的自动确认收货功能，相关订单的货款需消费者主动确认收货或主动申请退款后，方可进入商家账户。
						7.6. 补贴。对于商家因参加甲方平台各类活动而获得的补贴，包括但不限于各类优惠券、代金券、现金抵用券补贴，甲方将以减免、返还技术服务费等形式提供，商家应根据甲方要求向甲方开具合法有效的发票。
						7.7. 店铺资金限制。双方确认，甲方有权关闭商家后台的提现功能，限制商家店铺资金提现。同时，甲方有权自商家店铺资金中扣划相应消费者赔付金、违约金以及其他费用或款项。商家无条件并不可撤销地授权甲方通知相关合作方（包括但不限于第三方支付机构、合作银行等）立即停止向商家支付货款等结算款项、直接扣划店铺资金等。
						8. 知识产权
						8.1.
						商家权利保证。商家保证已合法取得其店铺经营或宣传推广所涉知识产权或其他相关权利的使用权。商家保证拥有履行本协议所需的资质和权利，并承诺在觅活平台发布、使用或者向觅活平台提交的内容不侵犯他人知识产权。本协议履行过程中因侵犯他人知识产权发生或引起的任何索赔或纠纷，由商家自行负责处理并独立承担责任；因此造成甲方及/或甲方关联公司损失的，商家应承担赔偿责任。
						8.2.
						授权平台使用。对于商家因店铺经营或宣传推广而在觅活平台发布、使用或者向觅活平台提交的内容，包括但不限于专利、商标、名称、特有标识、装潢、技术秘密、肖像、版式设计、图片、音频、视频等，商家特此授权甲方为本协议下目的使用其知识产权及其他相关权利，且商家保证该等授权许可是合法有效的、免费的、非独家的、不可撤回的。
						8.3.
						平台自有知识产权的保留。商家知悉并同意，甲方或其关联公司拥有、使用、许可、控制的或者甲方或其关联公司对之享有其他权利的一切知识产权、工业产权和专有权利，包括全部商标、著作权、名称、标识、标志、微信公众号、域名、网站名称、网页、艺术作品、人物形象、专利，例如“觅活”、“觅活商城”、“觅活”app图标等，由甲方或其关联公司独家拥有并保留。
						8.4.
						侵犯平台知识产权行为的禁止。商家同意并保证，其任一级代表、代理、受托人或代表其各自的董事、高级管理人员或职工及其自身，不得在中国之境内外注册、使用与甲方及其关联公司拥有、使用、许可或控制的商标、名称、标识、标志、微信公众号、域名、网站名称、网页、艺术作品、人物形象等相同或近似的商标，或侵犯甲方或其关联公司享有的一切知识产权、工业产权和专有权利，或妨碍甲方或其关联公司独自全部拥有或保留前述权利。
						8.5.
						商家应当维护觅活、觅活关联公司、觅活品牌的商业信誉和声誉，未经觅活书面授权，不得以觅活、觅活关联公司或觅活品牌名义，或以前述主体合作方的名义对外发布消息，包括但不限于在未经觅活书面授权的情况下，在任何渠道和场景发布、发表、传播、披露、引用、转载任何觅活、觅活关联公司或觅活品牌的言论、文章、音频、视频、素材、图片、照片、信息、文件、数据等，或对外宣称系觅活合作方，或与觅活存在商业联合、许可使用、商业冠名、广告代言等联系。
						8.6. 商家责任。乙方同意并保证，若其注册与甲方及甲方关联公司相同或近似的商标、名称、标识、标志、微信公众号、域名、网页等，用于开展与甲方及甲方关联公司实质相同或近似的业务，则应当在甲方或甲方关联公司提出相关要求时，无偿将相关商标、名称、标识、标志、微信公众号、域名、网页等转让给甲方或甲方关联公司。如由此给甲方及/或甲方关联公司造成损失的，乙方应赔偿全部损失并消除给甲方及/或甲方关联公司造成的不良影响，同时甲方有权采取限制商家店铺资金提现、直接自商家店铺资金中扣划损失赔偿金等措施，并有权立即解除本协议。
						9. 保密条款
						9.1.
						保密信息范围及保密期限。商家承诺在谈判、磋商、签订及履行本协议过程中获知或接触到的觅活及/或其关联公司的任何信息、文件、数据、资料等（合称“保密信息”）进行保密（包括但不限于本协议任何补充协议所述内容、商业秘密、技术信息、雇员信息、职位信息及在合作过程中涉及的其他秘密信息等）。未经觅活事先书面同意，不得以任何形式交付或泄露给任何第三方，也不作任何除本协议目的之外的其他用途。商家确认，本协议保密条款永久有效，不因本协议被撤销、被宣告无效、失效、解除、中止、终止而失效。
						9.2. 对于本协议履行过程中觅活提供的资料，觅活有权随时要求商家立即返还或者永久予以销毁和删除。
						9.3.
						商家使用平台资料的限制。商家不得将从甲方平台获取的任何信息或数据用于本协议约定以外的用途；未经甲方事先书面许可，不擅自获取、使用、传播、披露、复制、转移或许可第三方使用甲方平台的任何资料、甲方的名称、商标、标志、商业信息、技术及其他资料。
						10. 承诺与保证
						10.1. 遵守协议与规则。商家保证严格遵守本协议及平台规则，不从事任何有损甲方利益的行为。
						10.2. 商品和信息。商家保证所发布、销售的商品或信息符合如下要求：
						（1）来源正当合法，除商品详情另外说明外，均为全新正品；
						（2）不侵犯任何第三方的合法权益（包括但不限于物权、债权、著作权、商标专用权、专利权等）；
						（3）甲方不会因商家在觅活平台开设店铺或销售产品而受到任何第三方投诉/起诉；
						（4）不属于违禁商品或信息，即相关法律法规或平台规则禁止出售的商品或禁止发布的信息，包括但不限于虚假或引人误解的信息。
						10.3.
						描述。商家自行编辑上传的店铺名称及描述、商品说明、介绍、图片等信息资料是真实有效并恰当反映店铺和商品特性的，不存在虚假、伪造或侵犯第三方权益的内容，不存在违反《中华人民共和国广告法》、《中华人民共和国价格法》等法律法规的情形，且商家保证甲方在其平台使用上述信息资料不会侵犯第三方的权益。
						10.4. 商品质量及售后。商家将按照不低于《中华人民共和国产品质量法》、《中华人民共和国消费者权益保护法》及其他法律法规、国家强制性标准以及平台规则的要求，出售商品并提供“三包”等售后服务。
						10.5. 充分披露。商家承诺未隐瞒任何其他信息以致足以影响甲方签订及履行本协议。
						10.6. 诚实信用。商家保证在使用觅活平台进行交易的过程中遵守诚实信用原则，不在交易中采取虚假宣传、混淆等欺诈或不正当竞争行为，不扰乱网络交易的正常秩序，不从事与网上交易无关的行为。
						10.7.
						经营模式。商家承诺不抄袭、模仿甲方商业模式业务。商家与甲方合作期间，甲方有权监督商家的经营行为，并对商家诱导非官方交易的行为做出处理，相关定义及违规判定、处理方式以平台规则的规定为准。
						10.8.
						虚假交易的禁止。商家不得以任何手段利用甲方平台规则漏洞或系统漏洞，通过虚假交易套取觅活旗下产品及服务的优惠券、积分、红包、补贴等（或统称“补贴”），或者获取虚假商品销量、虚假好评、虚假信用评价等不当利益，或者恶意损害其他商家或任何第三方合法权益。
						10.9.
						账户的保管。商家应妥善保管、使用甲方提供的相关账户（包括但不限于用户名、原始密码信息）及/或商家自行修改的密码，并确保使用其该等账户的主体均为商家或商家授权的人员；除非适用的法律法规另有明确规定或本协议另有明确的约定，商家不得以任何形式泄露、擅自转让、披露或授权他人使用该账户。
						10.10.
						违法行为的禁止。商家签署及履行本协议过程中应当遵守有关法律法规以及其他任何对其适用的规定，不得利用甲方或甲方平台从事任何违法活动，包括但不限于侵害任何第三方的合法权益或者获取任何不正当利益，商家应就其实施的与本协议有关的行为承担全部责任。
						10.11.
						商家数据的使用。商家知悉并同意：对于商家因开设店铺、经营需要、行使或履行本协议及平台规则的权利义务而向甲方提交的任何信息或数据，以及商家在经营过程中产生的交易数据、店铺或商品评价数据等，无论本协议是否终止，甲方均有权合理使用，使用方式包括但不限于依据该等信息或数据进行市场分析和调研，且甲方无义务返还商家。同时，甲方无义务就获取、备份、处理、使用前述信息或数据向商家支付任何费用。
						10.12.
						商家信息的披露。商家知悉并同意：甲方有义务根据有关法律要求向司法机关和政府部门提供商家的信息和资料。甲方有权根据自己的判断、有关协议和规则、国家生效裁判文书或者与交易有关的消费者的合理请求披露商家的信息资料，甲方对此不承担任何责任。
						10.13. 个人信息保护。商家保证严格依据《中华人民共和国网络安全法》等法律法规的规定以及本协议的约定，使用和保护用户（消费者）的个人信息，包括但不限于：
						（1）确保通过合法渠道获取、使用和保存个人信息，按照用户的要求查询、更正、删除个人信息，保证不在违背用户真实意愿、未通过甲方审核或用户未明确同意的情况下，向甲方用户发送任何性质的商品推荐、推广信息等；
						（2）保证不会将从甲方平台获取的个人信息或数据用于本协议约定以外的用途，承诺不以任何方式、向任何第三方泄露/出售甲方平台用户的个人信息；
						（3）保证不擅自获取、使用、传播涉及甲方平台用户的任何资料，包括但不限于交易数据、账户信息、支付信息、甲方其他商家展示于甲方平台的信息等。
						10.14. 纠纷处理。对于因商家经营行为导致的，消费者、知识产权权利人或其他第三方向行政机关发起的举报投诉、向法院提起的诉讼，或行政机关主动介入调查等情形，商家保证积极处理。
						10.15. 商家责任
						10.15.1. 一般责任。商家违背第10.1条至第10.14条保证或者承诺的，应当自行负责处理由此产生的争议、纠纷、处罚、诉讼、仲裁、投诉、索赔等，并承担全部法律责任（包括但不限于赔偿由此给消费者、甲方及/或任何他方造成的全部损失），确保甲方免于承受与此相关的任何索赔、责任追究或损失。同时，甲方有权制止商家的违法违约行为，追究商家的违约及/或侵权责任，包括但不限于对商家采取以下各类措施中的一项或多项：
						（1）部分或全部商品屏蔽、降权、下架、禁售、删除；
						（2）部分或全部商品移除资源位、禁止上资源位、移除广告；
						（3）店铺禁止上新、禁止上架、店铺降级；
						（4）关闭或限制商家账户权限、店铺功能；
						（5）限制退店；
						（6）提高店铺保证金标准、限制店铺资金提现；
						（7）扣除保证金；
						（8）单方解除本协议，终止与商家的合作；
						（9）平台规则规定的其他违规处理措施。
						10.15.2. 特别责任。商家违背第10.8条承诺，套取补贴的，甲方除有权按照第10.15.1条的规定进行处理以外，还有权从商家店铺资金中扣除相当于补贴金额数倍的款项作为违约金；商家行为构成犯罪的，甲方有权向公安部门报案以进一步追究商家刑事责任。
						10.15.3. 乙方与甲方产生纠纷的，包括但不限于甲方收到乙方索赔或要求甲方承担责任的函件、司法机关发送的与双方纠纷相关的法律文书等，鉴于双方合作基础丧失或者发生重大变化，以及为妥善解决双方之间已有的纠纷，且避免产生任何进一步的纠纷，除本协议另有约定外，甲方还有权对乙方及其具备关联关系的店铺/账户如下一项或多项处理措施：
						（1）部分或全部商品屏蔽、降权、下架、禁售、删除；
						（2）部分或全部商品移除资源位、禁止上资源位、移除广告；
						（3）店铺禁止上新、禁止上架、店铺降级；
						（4）关闭或限制店铺/账户权限、店铺/账户功能；
						（5）限制退店；
						（6）限制店铺/账户资金提现；
						（7）扣除保证金；
						（8）平台规则规定的其他处理措施。
						11. 关联关系条款
						11.1. 关联关系的情形。甲方有权将具备关联关系的店铺/账户（指使用觅活旗下产品及服务的所有账户，包括但不限于商家账户、用户账户等，下同）形成关联圈。前述关联关系是指店铺/账户存在下列情形之一：
						（1）店铺/账户的入驻人、管理人、紧急联系人、退货信息、账户主体及主体信息等任一登记信息存在直接/间接交叉（若前述信息发生过变更，则包括变更前后的主体及相关信息，下同）；前述登记信息是指店铺/账户在觅活旗下产品及服务下登记的所有信息，包括但不限于公司名称及其统一社会信用代码、人员姓名及身份信息、联系电话、邮箱、地址信息等；
						（2）店铺/账户的提现银行账户和/或其他类似账户（例如微信等，以下合称“账户”）、与提现账户绑定的手机号码、费用缴纳/充值账户等任一信息存在直接/间接信息交叉；
						（3）店铺/账户的登陆IP、登陆设备号等任一信息存在直接/间接交叉；
						（4）存在其他类似性质的信息直接/间接交叉及关联。
						11.2. 统一管理。甲方有权对关联圈内的店铺/账户进行统一管理，包括但不限于统一增加或扣减信誉值，统一扣划店铺/账户资金，统一中止/终止平台服务等。
						11.3. 关联店铺/账户的处理。若关联圈中的任一店铺/账户存在违反相关法律法规、本协议、平台规则、或与觅活及/或觅活关联公司签署的任何其他协议的情形，甲方有权要求商家对关联圈内各店铺/账户间的关联关系作出正式的书面解释，也有权无需通知直接判定各店铺/账户间的关联关系；同时，甲方有权立即对违规店铺/账户及其关联店铺/账户统一采取以下各类措施中的一项或多项：
						（1）部分或全部商品屏蔽、降权、下架、禁售、删除；
						（2）部分或全部商品移除资源位、禁止上资源位、移除广告；
						（3）店铺禁止上新、禁止上架、店铺降级；
						（4）关闭或限制店铺/账户权限、店铺/账户功能；
						（5）限制退店；
						（6）提高店铺保证金标准、限制店铺/账户资金提现；
						（7）扣除保证金；
						（8）直接扣划各店铺/账户资金冲抵消费者赔付金及违约店铺/账户应承担的其他款项或费用；
						（9）单方解除本协议，终止与商家的合作；
						（10）限制店铺/账户主体使用其信息注册觅活旗下产品及服务的店铺/账户；
						（11）平台规则规定的其他违规处理措施。
						12. 有限责任
						12.1.
						纠纷处理。商家了解并同意，甲方及/或其关联公司并非司法机构，仅能以普通或非专业人员的知识水平标准对商家提交的证据材料进行鉴别，甲方及/或其关联公司对交易纠纷的调处、对知识产权维权投诉等事项的处理完全是基于商家的委托，或本协议约定、平台规则以及相关法律法规的规定，甲方及/或其关联公司无法保证交易纠纷或知识产权维权投诉等事项的处理结果符合商家的期望，也不对上述事项的处理结果及保证金赔付决定承担任何责任。商家应保证其提交的材料及信息的真实性、合法性，并承担其或买家、权利人或其他第三方提供的信息、数据不实的风险和责任。如商家因此遭受损失，商家同意自行向受益人或致损方索赔。
						12.2.
						技术手段。商家了解并同意，鉴于现有技术水平和客观条件的限制，甲方将采取一切可能的技术手段保持乙方使用甲方平台服务所涉的技术和信息的有效性、准确性、可靠性、及时性、稳定性、完整性，但甲方对此不作任何承诺或保证。
						12.3. 外部影响。不论在何种情况下，甲方均不对由于Internet连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，不可抗力，战争，政府行为，国际、国内法院的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。
						13. 期限和终止
						13.1. 期限。本协议期限为自签署之日起至协议解除之日止，但保密、违约责任、售后服务义务及产品质量保证责任在协议终止后将继续有效。
						13.2. 终止
						13.2.1. 商家退店。商家有权根据《觅活退店规则》申请解除本协议、退出觅活平台，甲方审核通过后本协议终止。
						13.2.2. 甲方解除。出现下列情形之一的，甲方有权单方解除本协议：
						（1）商家违反平台规则或本协议中的承诺或保证，包括但不限于本协议项下的任何约定;
						（2）商家超过九十（90）天未以商家后台管理账户及密码登录觅活平台;
						（3）商家未能按期全额支付有关服务费用和/或活动费用；
						（4）商家与甲方产生纠纷，或商家行为可能影响甲方商誉；
						（5）商家擅自终止履行本协议或者将本协议项下权利义务转让给任何第三方；
						（6）甲方自主决定解除本协议，并以书面形式提前通知商家；
						（7）可以解除协议的其他情形。
						13.3. 协议终止后事项的处理
						13.3.1. 账户关闭。自本协议终止之日起，甲方将关闭商家在甲方的账户权限，并对商家产品全部下架，商家将无法再通过该账户进行任何形式的操作，且觅活平台不再显示任何商家产品信息。
						13.3.2.
						数据处理。本协议终止后，甲方有权保留商家的注册信息及交易行为记录等数据，但甲方没有为商家保留这些数据的义务，亦不承担在协议终止后向商家或第三方提供任何数据信息的义务，也不就协议终止向商家或任何第三方承担责任，但法律另有规定的除外。
						13.3.3. 不免除售后责任。本协议终止并不免除商家依据本协议应向客户承担的售后服务及产品保证责任，商家仍应履行售后服务义务及产品质量保证责任；如在本协议终止后，因售后服务问题或商家产品质量问题导致甲方或其他第三方人身或财产损失的，商家仍应承担全部责任。
						14. 违约责任
						14.1. 总体要求。商家违反与甲方的各项约定，或者违反平台规则及有关法律法规规定的，甲方有权要求商家承担违约责任。
						14.1.1.
						违约认定。商家理解并同意，甲方有权在本协议中约定及平台规则中规定违约认定程序和标准，甲方有权判定商家是否构成违约并采取处理措施。商家有义务及时对交易异常、数据异常现象及涉嫌违约行为进行充分举证和合理解释，甲方有权对商家举证的材料和解释进行审核，并根据审核结果作出相应处理。商家保证其提交的证据材料的真实性、合法性，并自行承担举证不能的后果。
						14.1.2.
						违约责任。商家的违约行为致使甲方及/或其关联公司利益遭受损失的，商家应赔偿甲方及/或其关联公司的损失（含直接损失和间接损失）。上述损失包括但不限于直接经济损失、消费者流失损失、商誉损失、机会损失、业务影响损失、管理成本、解除成本、向第三方支付的经济补偿/赔偿（如有）、由此导致的行政罚款，以及甲方及/或其关联公司为减少损失、防止损失扩大、固定证据、维权或者追究商家相关法律责任所支出的诉讼费、保全费、保全保险费、公证费、律师费、调查取证费用
						、交通差旅费、评估费、鉴定费、审计费、诉讼费用等一切有关费用和支出。商家的违约行为造成甲方及/或其关联公司商誉受损的，商家还应为甲方及/或其关联公司消除影响，消除影响的方式包括但不限于在公开发行的报刊、新闻媒体上刊登声明等。
						14.2. 消费者赔付金。商家违反本协议约定及/或平台规则之规定，按约需承担消费者赔付金的，甲方有权决定赔付方式（包括但不限于发放长期有效的无门槛现金券），相关消费者赔付金由商家承担。
						14.3.
						纠纷处理的费用承担。若因商家自行编辑、上传的店铺信息、产品素材问题、产品质量问题或因发错货、超卖、退货处理不及时等原因导致甲方被第三方投诉、起诉的，甲方有权选择与第三方和解、调解或诉讼，商家应承担由此支出的一切费用并承担甲方因此遭受的一切损失。
						14.4. 店铺资金扣除。商家出现下列情形之一的，一切损失和责任由商家承担，同时甲方有权扣除商家全部保证金或暂停支付商家销售款项：
						（1）因甲方宣传商家产品，引起的第三方维权、投诉、诉讼等；
						（2）因商家原因致使价格或活动设置错误，甲方进行先行赔付后三（3）个工作日内商家未赔偿给甲方。
						14.5. 保证金的扣划与补缴。甲方有权在要求商家承担合同约定责任外扣除部分或全部保证金。甲方扣划保证金后，商家应在接到甲方通知后三日内补齐，否则，甲方有权在商家结算款项中直接扣划。保证金的扣除并不免除甲方要求商家按合同约定承担的违约责任。
						14.6. 乙方违约行为的范围。乙方有义务对其履约行为、履约人员、辅助乙方履行协议的义务人等进行有效管理，乙方保证乙方及其代表、代理、受托人，或乙方及其关联公司的董事、高级管理人员、股东、顾问、代理、雇员（含临时）、辅助乙方履行协议的义务人及其工作人员等相关人员均不会实施任何违反本协议的行为，前述主体实施的行为均视为乙方行为，若该等行为违反本协议约定，则由乙方按本协议约定承担违约责任。
						14.7. 费用的支付。商家违反本协议约定而需向甲方支付的任何违约金、赔偿金及其他所有费用，应在甲方通知后既定的工作日内一次性支付给甲方，否则，甲方有权在结算款项中直接扣除，并向商家追索不足部分。
						14.8. 不免除售后责任。由于商家发生上述违约行为导致商家应赔偿甲方损失或支付赔偿金、违约金，商家仍需继续执行售后服务并对已售出的商品承担一切责任。
						14.9. 平台的责任。协议履行期间，若甲方违反本协议约定导致商家遭受损失的，商家有权要求甲方承担违约责任。
						15. 不可抗力
						15.1.
						由于不可抗力事件导致一方不能及时履行或者不能履行该方在本协议下的任何义务（付款义务除外）的，不构成违约。但是受不可抗力事件影响的一方应立即把不可抗力事件的性质和程度通知对方，并积极采取相应补救措施，以最大程度地减少和避免损失。
						16. 反商业贿赂及利益冲突条款
						16.1
						乙方向甲方特此承诺，乙方、乙方的关联公司、乙方或其关联公司的管理人员、董事、法定代表人、股东、顾问、代理、雇员（含临时）、工作人员、辅助乙方履行协议的义务人（以下统称“乙方人员”）自愿遵守本条款约定，不得通过甲方、甲方的关联公司、甲方或其关联公司的工作人员（以下统称“甲方人员”）或其密切关系人（包括但不限于配偶、亲属、情侣、师生、同学、战友、朋友、前同事等关系，下同）牟利，如乙方人员为签署本协议或在本协议签署后实施了违反本条款规定的行为，依据本条款处理。
						16.2
						乙方人员不得以任何名义向甲方人员或其密切关系人直接或间接地、明示或暗示地提议、许诺、同意、默认、追认、输送任何形式的利益，包括但不限于金钱物品、消费卡券、干股分红、有价证券、股权债权、金融产品、虚拟财产、礼品样品、回扣佣金、招待宴请、娱乐旅游、消费安排、财物借用、债务抵扣、费用减免、劳务服务、就业置业、就医就学、荣誉头衔、资格资质评定、特殊待遇等（以下简称“本条款下的利益”）。
						16.3 乙方人员不得以任何名义与甲方人员或其密切关系人发生任何形式的经济往来（包括但不限于借贷投资、借用租用、担保抵押等）或合作（包括但不限于入股、顾问、雇佣等）。
						16.4
						乙方人员不得为甲方人员或其密切关系人寻求、获取、掩饰、隐瞒本条款下的利益提供任何形式的帮助，包括但不限于居间斡旋、托管代持、出借账户、销毁凭据、虚构事实、隐匿资产等行为及提供实施前述行为的便利条件。
						16.5 乙方人员不得寻求、获取因甲方人员或其密切关系人的个人关系或不当行为而产生的任何利益或竞争优势。
						16.6 乙方人员发现甲方人员或其密切关系人索取或收受本条款下的利益，应及时向甲方举报并提供相关证据。甲方设有专用邮箱（lixin@51mihuo.com）接收举报。
						16.7
						若甲方发现或收到内外部举报（包括但不限于甲方/乙方合作方、甲方人员或乙方人员、其他第三方等）关于乙方或乙方人员给予商业贿赂或违反本条款的其他行为的投诉、举报，乙方及乙方人员应配合甲方及其关联公司的调查和访谈，并为此提供所有相关信息和协助（包括但不限于提供详细的相关账目和证明材料），配合甲方审阅及协助甲方进行的任何合规审计和调查。
						（1）如乙方或乙方人员拒绝配合，或拒绝按甲方要求披露相关信息或材料，或在甲方指定期限内未进行合理解释及有效举证，或经举证仍不能有效证明未有相关投诉/举报所涉行为的，甲方有权直接判定乙方/乙方人员违反本条款约定，存在投诉/举报所涉违规行为。
						（2）乙方保证，乙方及乙方人员配合甲方或其关联方的调查或访谈时提供的所有信息真实、合法、有效，不存在任何虚假内容。
						（3）乙方保证，调查、访谈或协助过程中，非经甲方及其关联方事先书面确认，乙方及乙方人员不会将任何与投诉/举报相关的信息、调查/访谈/协助相关信息等以任何形式泄露。
						16.8 利益冲突的报备。乙方必须主动披露任何可能出现利益冲突的情况，并自相关情况出现之日起三日内以书面形式报备至甲方指定的邮箱（lixin@51mihuo.com），相关情况包括但不限于：
						（1）乙方人员与甲方或甲方关联公司离职人员或其密切关系人，以合伙、合作、入股、咨询顾问、代理、雇佣等任何形式进行合作的；
						（2）乙方人员与甲方人员（含已离职人员）之间存在其他利益关系、密切关系或个人关系的，包括但不限于债权债务关系、恋爱关系、（曾经）共事关系、好友关系、师生关系、同学关系等。
						16.9
						鉴于商业贿赂及利益冲突行为会严重破坏经营秩序，损害营商环境，甲方始终对此零容忍，乙方充分知悉违反本条的约定对甲方利益的严重损害程度，因此，乙方理解并确认：甲方及其关联方有权结合内外部举报情况、调查/访谈等情况独立判断乙方/乙方人员是否存在违反本反商业贿赂及利益冲突条款的行为；若乙方人员违反本条款的任何约定的，甲方有权立即解除本协议、终止本协议及/或双方在其他合同项下的合作，有权拒绝结算全部款项，并要求乙方按照标准进行赔偿，且应赔偿甲方因此遭受全部损失。乙方充分理解上述违约金性质为惩罚性违约金，后续不以任何理由主张前述违约金金额过高而要求法院调整。如乙方违反本条约定的，乙方无条件放弃向人民法院申请要求调低违约金金额的权利。如乙方违约的情形涉嫌犯罪的，甲方有权依法将犯罪线索移交司法机关处理，同时保留向乙方主张民事责任的权利。本条约定的违约责任与本协议其他条款不一致的，以本条约定为准。同时，甲方有权对乙方采取以下各类措施中的一项或多项：
						（1）全部商品屏蔽、降权、下架、禁售、删除；
						（2）全部商品移除资源位、禁止上资源位、移除广告；
						（3）店铺禁止上新、禁止上架、店铺降级；
						（4）关闭或限制商家账户权限、店铺功能；
						（5）限制退店；
						（6）提高店铺保证金标准、限制店铺资金提现；
						（7）扣除保证金；
						（8）单方解除本协议，终止与乙方在本协议下的合作或任何其他协议下的全部合作；
						（9）限制乙方使用其信息注册觅活旗下产品及服务的相关店铺或账户；
						（10）平台规则规定的其他违规处理措施。
						17. 其他
						17.1.
						条款的独立性。如果根据适用的法律认定本协议中的任何条款或者任何条款中的任何部分无效、违法或者不具有可执行性，这种无效、违法或者不具有可执行性不影响本协议中的任何其它条款或者这些条款中的任何其它部分的效力。
						17.2. 法律适用。本协议的订立、履行、解释、变更及争议解决均适用中华人民共和国法律（为本协议之目的，不包括香港、澳门特别行政区及台湾地区法律，不包括冲突法规则）。
						17.3. 争议解决
						17.3.1. 约定管辖。对于因本协议产生的或者与本协议有关的争议，应友好协商解决，协商不成的，任何一方均有权提起诉讼，且双方一致同意由甲方住所地人民法院管辖。
						17.3.2.
						平台与买家的管辖约定。商家了解并确认：甲方已通过《觅活用户服务协议》与买家约定，对于因《觅活用户服务协议》而产生的或者与该协议有关的争议，若甲方为争议当事人之一的，各方应努力通过友好协商的方式进行解决，协商不成的，任何一方均有权提起诉讼，且各方一致同意由甲方住所地人民法院管辖。商家不得以任何方式排除《觅活用户服务协议》中该项管辖条款的适用；如商家自行发布或与用户约定的网络购物合同管辖条款与《觅活用户服务协议》约定的管辖条款冲突的，以《觅活用户服务协议》约定为准。
						17.4. 通知及送达
						17.4.1. 通知。本协议签订或履行过程中，甲方向商家寄送的书面通知，在交邮后第五个自然日即视为送达，商家指定邮寄地址为其身份证住址或住所地。书面通知形式还包括但不限于在觅活平台公告、向商家发送电子邮件、平台站内信、系统信息、手机短信、QQ消息和传真等电子方式，在采用电子方式进行通知的情况下，发送当日即视为送达。商家应保证提供的联系信息（包括但不限于身份证住址、住所地、联系地址、联系人、联系电话、电子邮箱，下同）真实、准确、有效，如信息变更应立即在觅活平台系统更新；如商家未及时更新，向原联系方式送达的仍视为有效送达。
						17.4.2. 法律文书送达。对于因本协议或因本协议所规定事项引起或与之相关的任何纠纷（包括但不限于一切与商家在觅活平台发布信息、销售商品或提供服务相关的纠纷），商家声明认可以下内容：
						（1）司法机关可通过包括但不限于诉讼平台、手机短信、邮寄、电子邮件等便捷有效的方式向商家送达包括但不限于起诉状副本、证据副本、举证通知书、应诉通知书、传票、判决书、裁定书、调解书等法律文书，诉前调解组织可通过手机短信、邮寄、电子邮件等方式向商家送达调解材料。商家认可上述送达方式的有效性及合法性。以中国审判流程信息公开网（https://splcgk.court.gov.cn）、移动微法院（微信小程序）等诉讼平台送达的，有效送达的认定以诉讼平台送达规则为准。以手机短信方式送达的，短信发送至商家提供给觅活平台的手机号码即视为送达。以邮寄方式送达的，寄送至商家提供给觅活平台的联系地址，签收或邮件退回之日即为送达之日。以电子邮件方式送达的，邮件发送至商家提供给觅活平台的电子邮箱地址即视为送达。
						（2）商家同意司法机关及诉前调解组织可采取以上一种或多种送达方式向其送达，采取多种方式送达的，送达时间以上述送达方式中最先送达的为准。
						（3）商家确认的上述送达方式适用于各个司法阶段，包括但不限于诉前调解、一审、二审、再审、执行以及督促程序（含支付令送达）。
						（4）商家保证提供的联系方式是真实、准确、有效的。如果因提供的联系信息不准确或变更联系方式不及时告知，致使商家无法接收或未及时接收的，视为送达。
						17.5. 诉讼程序适用。商家理解并同意，消费者起诉的简单网络购物合同纠纷案件，知识产权权利人起诉的简单知识产权纠纷案件，包括图片类、音乐作品类著作权侵权案件以及商标权侵权案件等，如上述案件系事实清楚、权利义务关系明确、争议不大的纠纷，可适用小额诉讼程序审理，具体标准详见法院审理规则及相关法律规定。
					</text>
				</view>
			</scroll-view>
		</view>



		<view class="item-other">
			<u-checkbox v-model="checkbox" shape="circle" size="30rpx" @change="getCheckbox">
			</u-checkbox>
			<text class="item-name">我已阅读并同意</text>
			<text class="item-bock" @click="getAgreement()">《觅活平台店铺协议》</text>
		</view>

		<view class="bottom-contain">
			<view class="button-list">
				<view class="item-button" :class="[checkbox ? 'item-button-active':'']" @click="getButton()">已阅读并同意
				</view>
			</view>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				option: {},
				checkbox: false,
			}
		},
		computed: {
			getClass() {
				if (uni.getSystemInfoSync().platform == "android") {
					return 'agreement-text-android'
				} else {
					return 'agreement-text-ios'
				}
			}
		},
		mounted() {

		},
		onShow() {

		},
		onLoad(option) {
			this.option = option
		},
		methods: {
			getButton() {
				if (this.checkbox) {
					this.$httpApi.addMyShop({
						cityOperatorId: uni.getStorageSync('cityOperatorId')
					}).then(res => {
						if (res) {
							this.$util.toast("操作成功");
							setTimeout(() => {
								this.goBack()
							}, 500)
						}
					})
				}
			},
			getAgreement() {
				uni.showLoading({
					title: '加载中'
				});
				uni.downloadFile({
					url: 'https://www.51mihuo.com/觅活平台店铺协议1024.docx',
					success: function(res) {
						var filePath = res.tempFilePath;
						uni.openDocument({
							filePath: filePath,
							showMenu: true,
							success: function(res) {
								// console.log('打开文档成功');
								uni.hideLoading();
							}
						});
					}
				});
			},
			getSubmit() {

			},
			getCheckbox() {

			}
		}
	}
</script>
<style lang="scss" scoped>
	/* @import url(); 引入css类 */

	.agreement-page {
		padding-top: 16rpx;

		.agreement-text {
			// #ifdef H5
			height: calc(100vh - var(--status-bar-height) - 88rpx - 124rpx - 16rpx - 70rpx);
			// #endif

			.scroll-y {
				height: 100%;
			}
		}

		.agreement-text-ios {
			height: calc(100vh - 88rpx - 124rpx - 60rpx);
		}

		.agreement-text-android {
			height: calc(100vh - 124rpx - 16rpx - 70rpx);
		}


		.item-contian {
			padding: 40rpx 30rpx;
			background-color: #fff;

			.title {
				text-align: center;
				font-weight: bold;
			}

			text {
				font-family: PingFang SC Medium;
				font-size: 28rpx;
				font-weight: normal;
				line-height: 50rpx;
				letter-spacing: 0px;
				color: #606166;
			}
		}

		.item-other {
			display: flex;
			justify-content: center;
			height: 70rpx;
			align-items: center;
			background-color: #fff;

			.item-name {
				color: #909199;
				font-size: 28rpx;
				margin-right: 6rpx;
			}

			.item-bock {
				color: #002FA5;
				font-size: 28rpx;
			}
		}
	}

	.bottom-contain {
		width: 100%;
		position: fixed;
		bottom: 0rpx;
		background-color: #FFF;
		z-index: 10;
		box-shadow: 0px -8rpx 8rpx rgba(201, 201, 201, 0.25);
		padding-bottom: 0;
		padding-bottom: constant(safe-area-inset-bottom);
		padding-bottom: env(safe-area-inset-bottom);
		display: flex;
		align-items: center;



		.button-list {
			display: flex;
			padding: 20rpx;
			width: 100%;

			.item-button {
				height: 84rpx;
				display: flex;
				flex: 1;
				justify-content: center;
				border-radius: 10rpx;
				background: #FFFFFF;
				box-sizing: border-box;
				border: 1px solid #EEEEEE;
				line-height: 84rpx;
				color: #909199;
				font-size: 32rpx;
			}

			.item-button-active {
				display: flex;
				flex: 1;
				justify-content: center;
				width: 164rpx;
				height: 84rpx;
				border-radius: 10rpx;
				background: #002FA5;
				box-sizing: border-box;
				border: 1px solid #fff;
				line-height: 84rpx;
				font-size: 32rpx;
				color: #fff;
			}
		}
	}

	/deep/ .u-checkbox {
		margin-right: 8rpx;
	}

	/deep/ .u-checkbox__label {
		display: none;
	}
</style>
